БИТУправление_медицинским_центром_демо/src/Enums/ВидыОтображенияЯчеек/ВидыОтображенияЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтображенияЯчеек</name>
  <enumValues>
    <name>КлиентУслугиРаздельно</name>
  </enumValues>
  <enumValues>
    <name>КлиентУслугиВместе</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ПоляОтображенияГрафикаВРасписании/ПоляОтображенияГрафикаВРасписании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоляОтображенияГрафикаВРасписании</name>
  <enumValues>
    <name>Время</name>
  </enumValues>
  <enumValues>
    <name>ВидВремениГрафика</name>
  </enumValues>
  <enumValues>
    <name>КабинетСотрудник</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СпособыОтображенияДополнительныхПолейРасписания/СпособыОтображенияДополнительныхПолейРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОтображенияДополнительныхПолейРасписания</name>
  <enumValues>
    <name>ПримечаниеКЗаявке</name>
  </enumValues>
  <enumValues>
    <name>ПримечаниеКДополнительнойЯчейке</name>
  </enumValues>
  <enumValues>
    <name>ДополнительнаяЯчейка</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяЯчейка</name>
  </enumValues>
  <enumValues>
    <name>КартинкиОсновнойЯчейки</name>
  </enumValues>
  <enumValues>
    <name>КартинкиДополнительнойЯчейки</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>Наличными</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>Сертификатом</name>
  </enumValues>
  <enumValues>
    <name>ЗаСчетФирмы</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/МедосмотрыПравилаОпределенияНеЗавершивших/МедосмотрыПравилаОпределенияНеЗавершивших.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МедосмотрыПравилаОпределенияНеЗавершивших</name>
  <comment>Не завершивший - это начавший медосмотр, но не дошедший до заключения</comment>
  <enumValues>
    <name>ЕстьОтметкиПрохождения</name>
  </enumValues>
  <enumValues>
    <name>ЕстьДокументПрохождения</name>
  </enumValues>
  <enumValues>
    <name>ЕстьДокументПрохожденияИгнорОтказа</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ПараметрыУчетнойПолитики/ПараметрыУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПараметрыУчетнойПолитики</name>
  <enumValues>
    <name>ШрифтКлиент</name>
  </enumValues>
  <enumValues>
    <name>ШрифтРабот</name>
  </enumValues>
  <enumValues>
    <name>ЗапретитьРучнойВводШККартыСкидокКлиенты</name>
  </enumValues>
  <enumValues>
    <name>ЗапретитьРучнойВводШКСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойВидОплаты</name>
  </enumValues>
  <enumValues>
    <name>ПересчитыватьСкидкиПриВыбореКартыКлиента</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьХочуРаньшеВЗаявках</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьОграничениеДоступаНаУровнеЗаписей</name>
  </enumValues>
  <enumValues>
    <name>ЗапретитьАдминистраторуЗаписьКлиентаНеВСвойФилиал</name>
  </enumValues>
  <enumValues>
    <name>ОграничиватьЧтениеФилиаломПользователя</name>
  </enumValues>
  <enumValues>
    <name>ЗапретитьЗаписьНаНерабочееВремяСотрудника</name>
  </enumValues>
  <enumValues>
    <name>НеЗаполнятьОплатуПоСуммеДокументаАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ДатыЗаписейЛистовОжидания</name>
  </enumValues>
  <enumValues>
    <name>ПериодыЗаписиЛистовОжидания</name>
  </enumValues>
  <enumValues>
    <name>СпособОбработкиСчитыванияШкКлиентаВЖЗ</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяСтрана</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЭлектронныеПодписиЭМК</name>
    <comment>Перенесена в регистр НастройкиМедицинскогоУчета</comment>
  </enumValues>
  <enumValues>
    <name>ИспользоватьОбменС1СБольничные</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойМакетОформленияСКД</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойВидМедКартДляПрофОсмотров</name>
  </enumValues>
  <enumValues>
    <name>МедкартуДляПрофосмотраСоздаватьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>МедкартуДляПрофосмотраИскатьДругие025у</name>
    <comment>Искать другие медкарты других видов 025/у для подстановки в прохождение медосмотра</comment>
  </enumValues>
  <enumValues>
    <name>ПоискКлиентаПоПодстрокеПоказыватьСДатойРождения</name>
    <comment>Только в документах с нашим запрограммированным поиском по подстроке</comment>
  </enumValues>
  <enumValues>
    <name>АвтозаполнениеПолучателяИИНН</name>
    <comment>Подставляет по выбранному клиенту данные о ФИО и ИНН в поля документов, из которых фискализируются кассовые чеки.</comment>
  </enumValues>
  <enumValues>
    <name>ЗапретитьЗаписьКлиентаНаДваПосещенияОдновременно</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураОжиданияКлиента</name>
    <comment>Для автопоиска времени записи клиента - для интервалов ожидания клиента между услугами</comment>
  </enumValues>
  <enumValues>
    <name>ПодборВремениЗаписиМаксВремяОжидания</name>
  </enumValues>
  <enumValues>
    <name>ПредлагатьСобиратьЗаявкиЗаДеньВДокументПродажи</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяСтатьяЗатратЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьКартыСкидок</name>
  </enumValues>
  <enumValues>
    <name>ВестиУчетТорговойДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяОбработкаSMSРассылки</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойВидДУЛ</name>
  </enumValues>
  <enumValues>
    <name>АвтоподстановкаИмениОтчества</name>
  </enumValues>
  <enumValues>
    <name>АвтозаполнениеНаправившегоВрача</name>
  </enumValues>
  <enumValues>
    <name>ФормаУчастияДляНаправившегоВрача</name>
  </enumValues>
  <enumValues>
    <name>ПризнакПодтвержденнойЗаявки</name>
  </enumValues>
  <enumValues>
    <name>ПериодОбновленияНепросмотренныхДокументовССайта</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьАвтоПодборКлиентовПоИмениИФамилии</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьШтрихкодированиеСотрудников</name>
  </enumValues>
  <enumValues>
    <name>СрокЖизниЛида</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьАвтоподборКлиентовПоКоду</name>
  </enumValues>
  <enumValues>
    <name>ПоказыватьСопутствующиеТовары</name>
  </enumValues>
  <enumValues>
    <name>РежимРазметкиКлиентскойОбластиШаблоновПриема</name>
  </enumValues>
  <enumValues>
    <name>ОсновнаяНастройкаОбменаССайтом</name>
  </enumValues>
  <enumValues>
    <name>БонусыЗапретОтрицательныхОстатков</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьПродажуМаркированныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>МедосмотрыПравилоОпределенияНезавершивших</name>
  </enumValues>
  <enumValues>
    <name>ЧекиЭлектронноПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>ЧекКММВыводитьQRКодНаДисплейПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМВариантПечатиДополнительнойРасшифровкиПлатежа</name>
  </enumValues>
  <enumValues>
    <name>КонтролироватьЗаполнениеШКМаркированногоТовараПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>ЗаСчетФирмыВидОплатыИспользуется</name>
  </enumValues>
  <enumValues>
    <name>АдресСервисаНСПК</name>
  </enumValues>
  <enumValues>
    <name>КалендарьЖурналаЗаписиРастягивать</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/КонфигурированиеЯчеекКалендаря/КонфигурированиеЯчеекКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонфигурированиеЯчеекКалендаря</name>
  <predefined>
    <items>
      <name>ОсновнаяНастройка</name>
      <description>Основная настройка</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОтображения</name>
    <type>
      <types>EnumRef.ВидыОтображенияЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВыводитьВремяВСвободныеЯчейкиЖЗ</name>
    <comment>Выводить время в свободные ячейки журнала записи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВыводитьКонтручастникаГрафикаВЖурналеЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВыводитьКонтручастникаГрафикаВПервойСтроке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеЯчеекКабинетовКакУСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаДополнительнойКолонки</name>
    <type>
      <types>CatalogRef.ЯчейкиКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаДополнительногоПоля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛеваяГраницаАктуальностиЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПраваяГраницаАктуальностиЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛинииСеткиВнутриЧаса</name>
    <comment>0 - пунктирная, 1 - сплошная (классическая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСостоянияЗаявкиТребуетПерерисовкиЖурналаЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фВыводГрупповых</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоследовательностьОтображения</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.ЯчейкиКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ВТойЖеСтроке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмещениеВЯчейках</name>
      <type>
        <types>EnumRef.СпособыОтображенияДополнительныхПолейРасписания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтображениеВидовВремениКабинетовСотрудников</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>EnumRef.ПоляОтображенияГрафикаВРасписании</types>
      </type>
    </attributes>
    <attributes>
      <name>ВПримечанииЯчейки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоВПервойСтроке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СортировкаСубъектовРасписания</name>
    <attributes>
      <name>ПолеСортировки</name>
      <type>
        <types>CatalogRef.Подразделения</types>
        <types>CatalogRef.Должности</types>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СортировкаСубъектовРасписанияРучнойПорядок</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаСубъектовРасписания</name>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкрашиваемыйЭлемент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ЯчейкиКалендаря/ЯчейкиКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЯчейкиКалендаря</name>
  <comment>0 - алгоритм на языке 1С,  1 - отбор СКД, 2 - доп. свойство</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиент</name>
      <description>Клиент</description>
    </items>
    <items>
      <name>Услуга</name>
      <description>Услуга</description>
    </items>
  </predefined>
  <attributes>
    <name>УсловиеПрименения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПризнака</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПризнака</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматУсловия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеСвойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередФормированием</name>
    <comment>Обработчик события на языке 1С</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/УправлениеНастройкамиПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает значение прейскуранта для филиала, если не заполнен, 
// то значение основного прейскуранта из учетной политики.
//
// Параметры:
//  Филиал	 - СправочникСсылка.Филиалы - Филиал.
// 
// Возвращаемое значение:
//   СправочникСсыка.Прейскуранты.
//
Функция ПолучитьПрейскурантФилиала(Знач Филиал = Неопределено) Экспорт 
	
	Возврат УправлениеНастройками.ПолучитьПрейскурантФилиала(Филиал);
	
КонецФункции

#Область ЖурналЗаписи

// Возвращает визуальные настройки для формирования журнала записи.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьВизуальныеНастройкиЖурналаЗаписи() Экспорт
	
	Результат = Новый Структура;
	ОсновнаяНастройкаЯчеек = Справочники.КонфигурированиеЯчеекКалендаря.ОсновнаяНастройка;
	
	Для Каждого Реквизит Из ОсновнаяНастройкаЯчеек.Метаданные().Реквизиты Цикл
		Результат.Вставить(Реквизит.Имя, ОсновнаяНастройкаЯчеек[Реквизит.Имя]);
	КонецЦикла;
	
	Результат.Вставить("ОсновнаяНастройкаЯчеек", ОсновнаяНастройкаЯчеек);
	Результат.Вставить("ШиринаКолонкиКлиента",?(ОсновнаяНастройкаЯчеек.ВидОтображения = Перечисления.ВидыОтображенияЯчеек.КлиентУслугиРаздельно,4,0.25));
	Результат.Вставить("ПоследовательностьОтображения",ОсновнаяНастройкаЯчеек.ПоследовательностьОтображения);
	Результат.Вставить("ЕстьВыводФилиала", ОсновнаяНастройкаЯчеек.ОтображениеВидовВремениКабинетовСотрудников.Найти(Перечисления.ПоляОтображенияГрафикаВРасписании.Филиал) <> Неопределено);
	
	Результат.Вставить("СортировкаСубъектовРасписания", ОсновнаяНастройкаЯчеек.СортировкаСубъектовРасписания.Выгрузить());
	
	ЦветаСубъектовТЧ = ОсновнаяНастройкаЯчеек.ЦветаСубъектовРасписания.Выгрузить();
	ЦветаСубъектовТЧ.Колонки.Добавить("ЦветФона");
	ЦветаСубъектовТЧ.Колонки.Добавить("КодПодразделение");
	Для Каждого ЦветСубъектаСтрока Из ЦветаСубъектовТЧ Цикл	
		ЦветСубъектаСтрока.ЦветФона = ЦветСубъектаСтрока.Цвет.Получить();
		ЦветСубъектаСтрока.КодПодразделение = ЦветСубъектаСтрока.Подразделение.Код;
	КонецЦикла;
	
	Результат.Вставить("ЦветаСубъектовРасписания", ЦветаСубъектовТЧ);
	//Результат.Вставить("ЦветаСубъектовРежимОтображения", ОсновнаяНастройкаЯчеек.ЦветаСубъектовРежимОтображения);
	
	СортировкаСубъектовРасписанияРучнойПорядокТЧ = ОсновнаяНастройкаЯчеек.СортировкаСубъектовРасписанияРучнойПорядок.Выгрузить();
	СортировкаРучнойПорядокПустаяТЧ = СортировкаСубъектовРасписанияРучнойПорядокТЧ.Скопировать(,"Значение");
	СортировкаРучнойПорядокПустаяТЧ.Колонки.Добавить("ЭтоГруппа");
	СортировкаРучнойПорядокПустаяТЧ.Очистить();
	СортировкаСубъектовРасписанияРучнойПорядокПодразделения	= СортировкаРучнойПорядокПустаяТЧ.Скопировать(); 
	СортировкаСубъектовРасписанияРучнойПорядокДолжности		= СортировкаРучнойПорядокПустаяТЧ.Скопировать();
	СортировкаСубъектовРасписанияРучнойПорядокСотрудник	= СортировкаРучнойПорядокПустаяТЧ.Скопировать();
	СортировкаСубъектовРасписанияРучнойПорядокСпециализации	= СортировкаРучнойПорядокПустаяТЧ.Скопировать();
	
	Для Каждого СтрокаРучнойСортировкиСубъектовРасписания Из СортировкаСубъектовРасписанияРучнойПорядокТЧ Цикл
		
		ИмяПоляСортировки = Строка(ТипЗнч(СтрокаРучнойСортировкиСубъектовРасписания.Значение));
		НоваяСтрока = Вычислить("СортировкаСубъектовРасписанияРучнойПорядок" + ИмяПоляСортировки + ".Добавить()");		
		Если ИмяПоляСортировки <> "Подразделения" Тогда
			НоваяСтрока.Значение = СтрокаРучнойСортировкиСубъектовРасписания.Значение;
			НоваяСтрока.ЭтоГруппа = НоваяСтрока.Значение.ЭтоГруппа;
		Иначе
			Если ЗначениеЗаполнено(СтрокаРучнойСортировкиСубъектовРасписания.Значение) Тогда
				НоваяСтрока.Значение = СтрокаРучнойСортировкиСубъектовРасписания.Значение.Код;
			Иначе
				НоваяСтрока.Значение = СтрокаРучнойСортировкиСубъектовРасписания.Значение;
			КонецЕсли;
			НоваяСтрока.ЭтоГруппа = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Вставить("СортировкаСубъектовРасписанияРучнойПорядокПодразделения", СортировкаСубъектовРасписанияРучнойПорядокПодразделения);
	Результат.Вставить("СортировкаСубъектовРасписанияРучнойПорядокДолжности", СортировкаСубъектовРасписанияРучнойПорядокДолжности);
	Результат.Вставить("СортировкаСубъектовРасписанияРучнойПорядокСотрудник", СортировкаСубъектовРасписанияРучнойПорядокСотрудник);
	Результат.Вставить("СортировкаСубъектовРасписанияРучнойПорядокСпециализации", СортировкаСубъектовРасписанияРучнойПорядокСпециализации);
	
	ПустаяТЧ = ОсновнаяНастройкаЯчеек.ПоследовательностьОтображения.Выгрузить(,"Ячейка, ВТойЖеСтроке");
	ПустаяТЧ.Очистить();
	ПустаяТЧ.Колонки.Добавить("Предопределенный", Новый ОписаниеТипов("Булево"));
	ПустаяТЧ.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СвойстваОбъектов"));
	ПустаяТЧ.Колонки.Добавить("ЯчейкаИмяПредопределенного", Новый ОписаниеТипов("Строка"));
	ПустаяТЧ.Колонки.Добавить("ЯчейкаРодитель", Новый ОписаниеТипов("СправочникСсылка.ЯчейкиКалендаря"));
	ПустаяТЧ.Колонки.Добавить("ЯчейкаРодительИмяПредопределенного", Новый ОписаниеТипов("Строка"));
	
	ПоследовательностьОтображенияОсновнойЯчейки				= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияОсновнойЯчейкиКлиент		= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияОсновнойЯчейкиУслуга		= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияПримечанияОсновнойЯчейки	= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияДопЯчейки					= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияПримечанияДопЯчейки		= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияКартинокОсновнойЯчейки		= ПустаяТЧ.Скопировать();
	ПоследовательностьОтображенияКартинокДопЯчейки			= ПустаяТЧ.Скопировать();
	
	пчСпособыОтображения = Перечисления.СпособыОтображенияДополнительныхПолейРасписания;
	НастройкиЯчеек = Новый Соответствие;
	НастройкиЯчеек.Вставить(пчСпособыОтображения.ОсновнаяЯчейка,					ПоследовательностьОтображенияОсновнойЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.ПримечаниеКЗаявке,					ПоследовательностьОтображенияПримечанияОсновнойЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.ДополнительнаяЯчейка,				ПоследовательностьОтображенияДопЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.ПримечаниеКДополнительнойЯчейке,	ПоследовательностьОтображенияПримечанияДопЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.КартинкиОсновнойЯчейки,			ПоследовательностьОтображенияКартинокОсновнойЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.КартинкиДополнительнойЯчейки,		ПоследовательностьОтображенияКартинокДопЯчейки);
	НастройкиЯчеек.Вставить(пчСпособыОтображения.ПустаяСсылка(),					ПоследовательностьОтображенияОсновнойЯчейки);
	
	ХранимыеПризнаки = Новый Массив;
	РассчитываемыеПризнаки = Новый Массив;
	ЕстьРассчитываемыеПризнакиЗаявок = Ложь;
	ПризнакиДопСвойств = Новый Массив;
	Для Каждого СтрокаНастроек Из ОсновнаяНастройкаЯчеек.ПоследовательностьОтображения Цикл
		СтрокаКэшируемыхНастроек = НастройкиЯчеек.Получить(СтрокаНастроек.РазмещениеВЯчейках).Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаКэшируемыхНастроек, СтрокаНастроек);
		СтрокаКэшируемыхНастроек.Предопределенный = СтрокаНастроек.Ячейка.Предопределенный;
		СтрокаКэшируемыхНастроек.ЯчейкаИмяПредопределенного = СтрокаНастроек.Ячейка.ИмяПредопределенныхДанных;
		СтрокаКэшируемыхНастроек.ЯчейкаРодитель = СтрокаНастроек.Ячейка.Родитель;
		СтрокаКэшируемыхНастроек.ЯчейкаРодительИмяПредопределенного = СтрокаКэшируемыхНастроек.ЯчейкаРодитель.ИмяПредопределенныхДанных;
		
		Если Не СтрокаКэшируемыхНастроек.Предопределенный Тогда
			Если СтрокаНастроек.Ячейка.ФорматУсловия = 2 Тогда
				СтрокаКэшируемыхНастроек.Свойство = СтрокаНастроек.Ячейка.ДополнительноеСвойство;
				ПризнакиДопСвойств.Добавить(СтрокаКэшируемыхНастроек.Свойство);
			ИначеЕсли СтрокаНастроек.Ячейка.РассчитыватьОнлайн Тогда
				РассчитываемыеПризнаки.Добавить(СтрокаНастроек.Ячейка);
				ЕстьРассчитываемыеПризнакиЗаявок = ЕстьРассчитываемыеПризнакиЗаявок Или СтрокаНастроек.Ячейка.ВидПризнака = 1;
			Иначе
				ХранимыеПризнаки.Добавить(СтрокаНастроек.Ячейка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проверим, есть ли РассчитываемыеПризнакиЗаявок хотя бы в цвете доп. ячейки
	Если Не ЕстьРассчитываемыеПризнакиЗаявок
		И ЗначениеЗаполнено(ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки)
		И ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки.ВидПризнака = 1
	Тогда
		ЕстьРассчитываемыеПризнакиЗаявок = Истина;
	КонецЕсли;
	
	// Фиксируем источник картинок (клиент или заявка)
	ПоследовательностьОтображенияКартинокОсновнойЯчейки.Колонки.Добавить("ЭтоКлиент", Новый ОписаниеТипов("Булево"));
	ПоследовательностьОтображенияКартинокДопЯчейки.Колонки.Добавить("ЭтоКлиент", Новый ОписаниеТипов("Булево"));
	Для Каждого ОписаниеКартинки Из ПоследовательностьОтображенияКартинокОсновнойЯчейки Цикл
		ОписаниеКартинки.ЭтоКлиент = ОписаниеКартинки.Ячейка.ВидПризнака = 0;
	КонецЦикла;
	Для Каждого ОписаниеКартинки Из ПоследовательностьОтображенияКартинокДопЯчейки Цикл
		ОписаниеКартинки.ЭтоКлиент = ОписаниеКартинки.Ячейка.ВидПризнака = 0;
	КонецЦикла;
	
	// Фиксируем данные по кол-ву ячеек картинок для ускорения проверки в коде
	Результат.Вставить("ЕстьКартинкиВОсновнойЯчейке", ПоследовательностьОтображенияКартинокОсновнойЯчейки.Количество() > 0);
	Результат.Вставить("ЕстьКартинкиВДопЯчейке",	  ПоследовательностьОтображенияКартинокДопЯчейки.Количество() > 0);
	Результат.Вставить("ЕстьПоляСортировки",		  Результат.СортировкаСубъектовРасписания.Количество() > 0);

	// Отдельно сформируем кэш для случая раздельного вывода клиента и услуг.
	Для Каждого СтрокаНастроек Из ПоследовательностьОтображенияОсновнойЯчейки Цикл
		Если СтрокаНастроек.ЯчейкаРодитель <> Справочники.ЯчейкиКалендаря.Клиент Тогда
			СтрокаКэшируемыхНастроек = ПоследовательностьОтображенияОсновнойЯчейкиУслуга.Добавить();
		ИначеЕсли СтрокаНастроек.ЯчейкаРодитель = Справочники.ЯчейкиКалендаря.Клиент Тогда 
			СтрокаКэшируемыхНастроек = ПоследовательностьОтображенияОсновнойЯчейкиКлиент.Добавить();	
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаКэшируемыхНастроек, СтрокаНастроек);
	КонецЦикла;
	
	// Добавим признак фона.
	Если ЗначениеЗаполнено(ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки) Тогда
		Если ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки.РассчитыватьОнлайн Тогда
			РассчитываемыеПризнаки.Добавить(ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки);
		Иначе
			ХранимыеПризнаки.Добавить(ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки);
		КонецЕсли;
	КонецЕсли;
		
	Результат.Вставить("ХранимыеПризнаки", ХранимыеПризнаки);
	Результат.Вставить("РассчитываемыеПризнаки", РассчитываемыеПризнаки);
	Результат.Вставить("ЕстьРассчитываемыеПризнакиЗаявок", ЕстьРассчитываемыеПризнакиЗаявок);
	Результат.Вставить("ПризнакиДопСвойств", ПризнакиДопСвойств);
	Результат.Вставить("ПоследовательностьОтображенияОсновнойЯчейки",			 ПоследовательностьОтображенияОсновнойЯчейки);
	Результат.Вставить("ПоследовательностьОтображенияПримечанияОсновнойЯчейки",	 ПоследовательностьОтображенияПримечанияОсновнойЯчейки);
	Результат.Вставить("ПоследовательностьОтображенияДопЯчейки",				 ПоследовательностьОтображенияДопЯчейки);
	Результат.Вставить("ПоследовательностьОтображенияПримечанияДопЯчейки",		 ПоследовательностьОтображенияПримечанияДопЯчейки);
	Результат.Вставить("ПоследовательностьОтображенияКартинокОсновнойЯчейки",	 ПоследовательностьОтображенияКартинокОсновнойЯчейки);
	Результат.Вставить("ПоследовательностьОтображенияКартинокДопЯчейки",		 ПоследовательностьОтображенияКартинокДопЯчейки);
	
	Результат.Вставить("ПоследовательностьОтображенияОсновнойЯчейкиКлиент", ПоследовательностьОтображенияОсновнойЯчейкиКлиент);
	Результат.Вставить("ПоследовательностьОтображенияОсновнойЯчейкиУслуга", ПоследовательностьОтображенияОсновнойЯчейкиУслуга);
	
	Результат.Вставить("ЦветФонаДопЯчейки", ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки);

	ПоляОтображенияГрафикаВЯчейке = Новый Массив;
	ПоляОтображенияГрафикаВПримечанииЯчейки = Новый Массив;
	
	пчПоляОтображенияГрафика = Перечисления.ПоляОтображенияГрафикаВРасписании;
	ОтображениеГрафика = ОсновнаяНастройкаЯчеек.ОтображениеВидовВремениКабинетовСотрудников;
	
	Результат.Вставить("ВыводитьВремяВСвободныеЯчейкиЖЗ",
						ОтображениеГрафика.Найти(пчПоляОтображенияГрафика.Время) <> Неопределено);
	
	Результат.Вставить("ОтображатьВидВремениГрафикаВЯчейке",
						ОтображениеГрафика.Найти(пчПоляОтображенияГрафика.ВидВремениГрафика) <> Неопределено);
	
	Результат.Вставить("ОтображатьКабинетСотрудникаВЯчейке",
						ОтображениеГрафика.Найти(пчПоляОтображенияГрафика.КабинетСотрудник) <> Неопределено);
	
	Результат.Вставить("ОтображатьФилиалВЯчейке",
						ОтображениеГрафика.Найти(пчПоляОтображенияГрафика.Филиал) <> Неопределено);
						
	РаботаСКлиентамиПереопределяемый.ЖурналЗаписиПолучитьВизуальныеНастройки(ОсновнаяНастройкаЯчеек, Результат);
					
	Возврат Результат;
		
КонецФункции

// Изменение состояния заявки требует ли перерисовки журнала записи. Если Ложь, то предполагается,
//  что достаточно обновить цвет заявки в журнале.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ИзменениеСостоянияЗаявкиТребуетПерерисовкиЖурналаЗаписи() Экспорт
	
	ОсновнаяНастройкаЯчеек = Справочники.КонфигурированиеЯчеекКалендаря.ОсновнаяНастройка;
	Возврат ОсновнаяНастройкаЯчеек.ИзменениеСостоянияЗаявкиТребуетПерерисовкиЖурналаЗаписи;
		
КонецФункции

// Истина, если в настройках ячеек календаря задан расчет цвета доп. ячейки.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЗаданЦветФонаДопЯчейкиЗаявкиЖурналаЗаписи() Экспорт
	
	ОсновнаяНастройкаЯчеек = Справочники.КонфигурированиеЯчеекКалендаря.ОсновнаяНастройка;
	Возврат ЗначениеЗаполнено(ОсновнаяНастройкаЯчеек.ЦветФонаДополнительнойКолонки);
		
КонецФункции

#КонецОбласти

// Возвращает структуру значений расширенной(дополнительной) учетной политики по умолчанию.
//
// Возвращаемое значение:
//  Структура - Структура со значениями параметров расширенной(дополнительной) учетной политики, 
//              в качестве ключа используется имя параметра. 
//
Функция ПолучитьУчетнуюПолитикуРасширеннуюПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура;
	
	ПараметрыХранилищеЗначения = ПолучитьПараметрыУчетнойПолитикиРасширеннойХранилищеЗначений();
	
	СтруктураВозврата.Вставить("ИспользоватьХочуРаньшеВЗаявках", Ложь);
	СтруктураВозврата.Вставить("ЗапретитьЗаписьНаНерабочееВремяСотрудника", Ложь);
	СтруктураВозврата.Вставить("ИспользоватьШтрихкодированиеСотрудников", Истина);
	СтруктураВозврата.Вставить("ЗапретитьРучнойВводШККартыСкидокКлиенты", Ложь);
	СтруктураВозврата.Вставить("ЗапретитьРучнойВводШКСертификатов", Ложь);
	СтруктураВозврата.Вставить("ЗапретитьАдминистраторуЗаписьКлиентаНеВСвойФилиал", Ложь);
	СтруктураВозврата.Вставить("ИспользоватьОграничениеДоступаНаУровнеЗаписей", Ложь);
	СтруктураВозврата.Вставить("ОграничиватьЧтениеФилиаломПользователя", Ложь);
	СтруктураВозврата.Вставить("ОсновнойВидОплаты", Перечисления.ВидыОплаты.Безналичные);
	СтруктураВозврата.Вставить("ПересчитыватьСкидкиПриВыбореКартыКлиента", Истина);
	СтруктураВозврата.Вставить("НеЗаполнятьОплатуПоСуммеДокументаАвтоматически", Ложь);
	СтруктураВозврата.Вставить("КалендарьЖурналаЗаписиРастягивать", Ложь);
	
	СтруктураВозврата.Вставить("ДатыЗаписейЛистовОжидания",
		CRMКлиентСервер.ПолучитьСтандартныеДатыЗаписиЛистовОжидания());
		
	СтруктураВозврата.Вставить("ПериодыЗаписиЛистовОжидания",
		CRMКлиентСервер.ПолучитьСтандартныеПериодыДатыЗаписиЛистовОжидания());
		
	СтруктураВозврата.Вставить("СпособОбработкиСчитыванияШкКлиентаВЖЗ", 0);
		
	Попытка
		ОсновнаяСтрана = Справочники.СтраныМира.Россия;
	Исключение
		ОсновнаяСтрана = Справочники.СтраныМира.ПустаяСсылка();
	КонецПопытки;
	СтруктураВозврата.Вставить("ОсновнаяСтрана", ОсновнаяСтрана);
	
	СтруктураВозврата.Вставить("ИспользоватьЭлектронныеПодписиЭМК", Ложь);
	
	СтруктураВозврата.Вставить("ОсновнойМакетОформленияСКД",
		БиблиотекаМакетовОформленияКомпоновкиДанных.ОформлениеОтчетовКлассический.Имя);
		
	СтруктураВозврата.Вставить("ОсновнойВидМедКартДляПрофОсмотров", Справочники.МедицинскиеКарты.ПустаяСсылка());		
	СтруктураВозврата.Вставить("МедкартуДляПрофосмотраСоздаватьАвтоматически", Ложь);
	СтруктураВозврата.Вставить("МедкартуДляПрофосмотраИскатьДругие025у", Ложь);
	СтруктураВозврата.Вставить("ПоискКлиентаПоПодстрокеПоказыватьСДатойРождения", Истина);
	СтруктураВозврата.Вставить("АвтозаполнениеПолучателяИИНН", Ложь);
	СтруктураВозврата.Вставить("ЗапретитьЗаписьКлиентаНаДваПосещенияОдновременно", Истина);
	СтруктураВозврата.Вставить("НоменклатураОжиданияКлиента", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураВозврата.Вставить("ПодборВремениЗаписиМаксВремяОжидания", Дата(1,1,1,0,10,0));
	СтруктураВозврата.Вставить("ПредлагатьСобиратьЗаявкиЗаДеньВДокументПродажи", Ложь);
	СтруктураВозврата.Вставить("ИспользоватьКартыСкидок", Истина);
	СтруктураВозврата.Вставить("БонусыЗапретОтрицательныхОстатков", Ложь);
	
	СтруктураВозврата.Вставить("ИспользоватьПродажуМаркированныхТоваров", Константы.ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов.Получить());
	СтруктураВозврата.Вставить("ВестиУчетТорговойДеятельности", Истина);
	СтруктураВозврата.Вставить("ЧекиЭлектронноПоУмолчанию", Ложь);
	СтруктураВозврата.Вставить("ЧекККМВариантПечатиДополнительнойРасшифровкиПлатежа", 0);
	СтруктураВозврата.Вставить("ЧекКММВыводитьQRКодНаДисплейПокупателя", Истина);
	СтруктураВозврата.Вставить("КонтролироватьЗаполнениеШКМаркированногоТовараПриПродаже", Ложь);
	СтруктураВозврата.Вставить("ЗаСчетФирмыВидОплатыИспользуется", Ложь);
	
	СтруктураВозврата.Вставить("ОсновнаяОбработкаSMSРассылки", Справочники.ОбработкиSMSрассылки.ПустаяСсылка());
	СтруктураВозврата.Вставить("МедосмотрыПравилоОпределенияНезавершивших", Перечисления.МедосмотрыПравилаОпределенияНеЗавершивших.ЕстьДокументПрохождения);
		
	Попытка
		ОсновнойВидДУЛ = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
	Исключение
		ОсновнойВидДУЛ = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка();
	КонецПопытки;
	СтруктураВозврата.Вставить("ОсновнойВидДУЛ", ОсновнойВидДУЛ);
	
	СтруктураВозврата.Вставить("АвтоподстановкаИмениОтчества", Истина);
	СтруктураВозврата.Вставить("АвтозаполнениеНаправившегоВрача", Ложь);
	СтруктураВозврата.Вставить("ФормаУчастияДляНаправившегоВрача", Справочники.ТрудовыеРоли.ПустаяСсылка());
	СтруктураВозврата.Вставить("ИспользоватьАвтоПодборКлиентовПоИмениИФамилии", Ложь);
	СтруктураВозврата.Вставить("СрокЖизниЛида", 0);
	СтруктураВозврата.Вставить("ПериодОбновленияНепросмотренныхДокументовССайта", 0);
	СтруктураВозврата.Вставить("ИспользоватьАвтоподборКлиентовПоКоду", Ложь);
	СтруктураВозврата.Вставить("ПоказыватьСопутствующиеТовары", Ложь);
	СтруктураВозврата.Вставить("РежимРазметкиКлиентскойОбластиШаблоновПриема", 0);
	СтруктураВозврата.Вставить("СписыватьМатериалыСтационараСразу", Ложь);
	СтруктураВозврата.Вставить("АдресСервисаНСПК", "https://api1.fes.nspk.ru");
	
	ПараметрыПеречисления = Перечисления.ПараметрыУчетнойПолитики;
	
	ЗначенияПеречисленияХранилищеЗначения = Новый Структура;
	
	Для Каждого ИмяПараметраХранилище Из ПараметрыХранилищеЗначения Цикл 
		ЗначениеХранилища = Неопределено;
		Если СтруктураВозврата.Свойство(ИмяПараметраХранилище) Тогда
			ЗначениеХранилища = СтруктураВозврата[ИмяПараметраХранилище];	
		КонецЕсли; 
		СтруктураВозврата.Вставить(ИмяПараметраХранилище, Новый ХранилищеЗначения(ЗначениеХранилища));
	КонецЦикла;

	Возврат СтруктураВозврата;	
	
КонецФункции

// Функция возвращает параметры учетной политики расширенной, хранящиеся как хранилище значений
//
// Параметры:
//  ВернутьИменаПараметров	 - Булево - если Истина, то в массиве будут имена параметров, а не ссылки.
// 
// Возвращаемое значение:
//  Массив - Массив, содержащий ссылки типа Перечисления.ПараметрыУчетнойПолитики или Строка - имена значений.
//
Функция ПолучитьПараметрыУчетнойПолитикиРасширеннойХранилищеЗначений(ВернутьИменаПараметров = Истина) Экспорт
	
	пчПараметры = Перечисления.ПараметрыУчетнойПолитики;
	МетаданныеЗначений = пчПараметры.ПустаяСсылка().Метаданные().ЗначенияПеречисления;
	
	ИменаПараметров = Новый Массив;
	ИменаПараметров.Добавить("ШрифтКлиент");
	ИменаПараметров.Добавить("ШрифтРабот");
	ИменаПараметров.Добавить("ДатыЗаписейЛистовОжидания");
	ИменаПараметров.Добавить("ПериодыЗаписиЛистовОжидания");
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из ИменаПараметров Цикл
		
		Если МетаданныеЗначений.Найти(ИмяПараметра) <> Неопределено Тогда
			
			Если ВернутьИменаПараметров Тогда
				Результат.Добавить(ИмяПараметра);
			Иначе
				Результат.Добавить(пчПараметры[ИмяПараметра]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
